<?php
$items = array(
	'система видеонаблюдения' => [
		'cameras.jpg',
		['Монтаж систем видеонаблюдения',
		'Установка камер видеонаблюдения',
		'Видеорегистраторы',
		'Готовые комплекты видеонаблюдения',
		'Беспроводное видеонаблюдение',
		'Уличное видеонаблюдение',
		'IP видеонаблюдение',
		'AHD видеонаблюдение',
		'Скрытые камеры',
		'Видеонаблюдение онлайн'],
		'Контроль доступа' => [
		'juurdepaasukontroll.jpg',
		['Электромагнитные замки',
		'Готовые комплекты',
		'Кодовый',
		'С карточкой',
		'С видеодомофоном',
		'По отпечатку пальца',
		'С учетом рабочего времени',
		'С дистанционным управлением',
		'Врезные',
		'Установка домофона',
		'Установка видеодомофона',
		'Комплекты домофонов',
		'Домофон с видеонаблюдением',
		'Беспроводной видеодомофон',
		'Обслуживание домофонов',
		'Ремонт домофонов',
		'Подъездные домофоны',
		'Аудиодомофон',
		'Биометрические панели',
		'Контроль доступа',
		'Кодовые замки',
		'Обслуживание СКУД',
		'Учет времени персонала',
		'Автоматические ворота',
		'Установка автоматики на ворота']]
		],
		'Сигнализация' => [
			'signalisatsioon.jpg',
			['Установка',
			'сирены и кодовая клавиатура',
			'Датчик движения',
			'Магнитный дверной датчик',
			'Пульт дальнего управления',
			'Пожарная сигнализация',
			'Охранная Сигнализация']
		],
		'Проектирование' => [
			'projekteerimine.jpg',
			['Проектирование электроснабжения',
			'Проектирование слаботочных систем']
		]
);
?>
<section class="volt--services mh100" id="services">
		<div class="container">
			<h3><b>УСЛУ</b><span><b>ГИ</b></span></h3>
		</div>
		<div class="service-boxes container" style="margin-top: 100px;">
			<div class="control-left">
				<img src="img/arrow_left.png" alt="">
			</div>
			<div class="control-right">
				<img src="img/arrow_right.png" alt="">
			</div>
			<div class="owl-carousel" id="owl">
			<!-- owl end -->
			<div class="accordion" data-img="services.jpg">
				<header>Электротехнические работы</header>
				<div class="item">
					<p>Установка и замена автоматических выключателей</p>
					<div>
						Автоматические выключатели – чувствительные приборы, которые нередко выходят из строя. Они
						становятся неисправными из-за короткого замыкания, по причине превышения допустимой
						нагрузки, но их замену и установку должны выполнять лишь специалисты. И таких
						профессионалов вы найдёте у нас!
					</div>
					<span class="hasText">
						+
					</span>
				</div>

				<div class="item">
					<p>Замена проводки</p>
					<div>
						Короткое замыкание часто возникает из-за неправильной эксплуатации электропроводки. Наши
						специалисты готовы посчитать ваши потребности в электричестве и порекомендовать самый
						оптимальный для вас вариант.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Заземление</p>
					<div>
						Правильное заземление – залог вашей электробезопасности. Мы поможем вам защититься от
						поражения током.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Сборка и установка электрощита</p>
					<div>
						Электрощит – сложное устройство, которое обеспечивает:
						<ul>
							<li>селективно срабатывающую защиту;</li>
							<li>контроль потока энергии;</li>
							<li>управление цепями и потребителями.</li>
						</ul>
						Наши профессионалы готовы подобрать для вас идеальный электрощит с оптимальным
						количеством контуров.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Монтаж электропроводки</p>
					<div>
						Опытные электрики компании VoltPartner на профессиональном уровне выполняют монтаж
						электропроводки любого типа (открытой, закрытой, комбинированной). Перед тем как приступить
						к работе, мы составим подробный план размещения розеток, выключателей, люстр, бра и будем
						ему следовать.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Прокладка кабеля</p>
					<div>
						Мы быстро подберём устройства электроустановок в соответствии с правилами. Учтём все
						особенности помещений и открытых мест (уличных лотков, траншей и т. д.).
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Установка ниш, замена выключателей и розеток</p>
					<div>
						Данные устройства – важная составляющая комфортного проживания. Они влияют на общий вид
						интерьера и при правильной установке не создают проблем в процессе эксплуатации.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Прокладка гильз под питающие кабели</p>
				</div>

				<div class="item">
					<p>Громоотводы</p>
					<div>
						Удар молнии очень опасен как для людей, так и для имущества. Но вы можете себя обезопасить,
						обратившись к нашим специалистам. Выберем лучшее место для монтажа громоотвода.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Монтаж систем освещения</p>
					<div>
						Согласно многочисленным исследованиям, плохое освещение негативно влияет на
						работоспособность персонала. Мы готовы подобрать и установить качественную осветительную
						систему, которая создаст комфортные условия для ваших сотрудников.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Монтаж светодиодного освещения</p>
					<div>
						LED прожекторов, LED потолка, LED модулей, освещение интерьера, Освещение ЛЕД
						здания.
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Установка и подключение бытовой техники</p>
					<div>
						<ul>
							<li>Установка и подключение электроплиты</li>
							<li>Подключение встроенных духовых шкафов</li>
							<li>Установка и подключение стиральной машины</li>
							<li>Установка посудомоечной машины</li>
							<li>Подключение кухонной вытяжки</li>
							<li>Подключение электрического накопительного водонагревателя</li>
						</ul>
					</div>
					<span class="hasText">+</span>
				</div>

				<div class="item">
					<p>Установка системы теплых полов</p>
					<div>
						Выберем именно ту систему, которая подойдет для вашего помещения и желаемого типа
обогрева. С учетом нормативов и финансовых возможностей.
					</div>
					<span class="hasText">+</span>
				</div>
			</div>
			<?php
				foreach($items as $heading => $arr) {
					echo '<div class="accordion" '.'data-img="'.$arr[0].'">';
					echo '<header>'.$heading.'</header>';
					for($x = 0; $x < count($arr[1]); $x++) {
						if(count($arr[1]) > 10) {
							if($x === 10){
								echo '<a href="javascript:void(0)" class="showMoreBtn">Näita kõik</a>';
								echo '<div class="hidden-items">';
								echo '<div class="item">';
								echo '<p>'.$arr[1][$x].'</p>';
								echo '</div>';
							}
							elseif($x === count($arr[1]) - 1){
								echo '<div class="item">';
								echo '<p>'.$arr[1][$x].'</p>';
								echo '</div></div>';	
							}
							else {
								echo '<div class="item">';
								echo '<p>'.$arr[1][$x].'</p>';
								echo '</div>';
							}
						}
						else {
							echo '<div class="item">';
							echo '<p>'.$arr[1][$x].'</p>';
							echo '</div>';
						}
					}
					echo '</div>';
				}
			?>
			</div>
		</div>
	</section>